## 2 pandas基础

### 2.1 文件读取写入

In [1]:
import pandas as pd

In [2]:
pd.read_table('data/my_table.txt',header =  None)

      0     1     2                3
0  col1  col2  col3             col4
1     2     a   1.4   apple 2020/1/1
2     3     b   3.4  banana 2020/1/2
3     6     c   2.5  orange 2020/1/5
4     5     d   3.2   lemon 2020/1/7

In [3]:
pd.read_csv('data/my_csv.csv')

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5
3     5    d   3.2   lemon  2020/1/7

In [10]:
# index_col 表示把某一列或几列作为索引
pd.read_csv('data/my_csv.csv',index_col=['col1','col2'])

           col3    col4      col5
col1 col2
2    a      1.4   apple  2020/1/1
3    b      3.4  banana  2020/1/2
6    c      2.5  orange  2020/1/5
5    d      3.2   lemon  2020/1/7

In [11]:
pd.read_csv('data/my_csv.csv')

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5
3     5    d   3.2   lemon  2020/1/7

In [5]:
pd.read_csv('data/my_csv.csv')

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5
3     5    d   3.2   lemon  2020/1/7

In [4]:
#  选择列
pd.read_csv('data/my_csv.csv',usecols=['col1','col2'])

   col1 col2
0     2    a
1     3    b
2     6    c
3     5    d

In [6]:
# parse_dates 表示需要转化为时间
pd.read_csv('data/my_csv.csv')

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5
3     5    d   3.2   lemon  2020/1/7

In [8]:
pd.read_csv('data/my_csv.csv',parse_dates=['col5'])

   col1 col2  col3    col4       col5
0     2    a   1.4   apple 2020-01-01
1     3    b   3.4  banana 2020-01-02
2     6    c   2.5  orange 2020-01-05
3     5    d   3.2   lemon 2020-01-07

In [9]:
#  nrows 表示读取的数据行数
pd.read_csv('data/my_csv.csv',nrows=2)

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2

In [3]:
# 分隔符
pd.read_table('data/my_table_special_sep.txt')

              col1 |||| col2
0  TS |||| This is an apple.
1    GQ |||| My name is Bob.
2         WT |||| Well done!
3    PT |||| May I help you?

In [2]:
pd.read_table('data/my_table_special_sep.txt',sep='\|\|\|\|',engine='python')  # 指定引擎为python，sep后跟的为正则表达式

  col1                 col2
0   TS    This is an apple.
1   GQ      My name is Bob.
2   WT           Well done!
3   PT      May I help you?

### 2.2 基本数据结构

In [3]:
# series,由data  index dtype name 组成
s = pd.Series(data = [100,'a',{'dict':5}],
              index = pd.Index(['ID1',20,'THIRD']),
              dtype ='object',
              name = 'my_name')

In [7]:
s

ID1              100
20                 a
THIRD    {'dict': 5}
Name: my_name, dtype: object

In [5]:
s.values

array([100, 'a', {'dict': 5}], dtype=object)

In [9]:
s.index

Index(['ID1', 20, 'THIRD'], dtype='object')

In [6]:
s.dtype

dtype('O')

In [12]:
s.shape

(3,)

In [15]:
s[20]

'a'

In [16]:
# DataFrame
data = [[1,2,'2'],[3,5,6],['e',7,5]]

In [17]:
data

[[1, 2, '2'], [3, 5, 6], ['e', 7, 5]]

In [21]:
df = pd.DataFrame(data,
                  index = ['row_%d'%i for i in range(3)],
                  columns = ['row_%d'%j for j in range(3)]
                  )

In [22]:
df

      row_0  row_1 row_2
row_0     1      2     2
row_1     3      5     6
row_2     e      7     5

In [25]:
df = pd.DataFrame(data = {'col_0':[1,2,3],
                          'col_1':[4,'a',5],
                          'col_2':[5,8,1]},
                          index = ['row_%d'%i for i in range(3)]
)

In [26]:
df

       col_0 col_1  col_2
row_0      1     4      5
row_1      2     a      8
row_2      3     5      1

In [39]:
[(lambda i:i+i) (i) for i in range(5)]

[0, 2, 4, 6, 8]

In [42]:
#  取dataframe中的数
df['col_0']

row_0    1
row_1    2
row_2    3
Name: col_0, dtype: int64

In [44]:
df.iloc[0:3]

       col_0 col_1  col_2
row_0      1     4      5
row_1      2     a      8
row_2      3     5      1

In [45]:
# 转置 
df.T

      row_0 row_1 row_2
col_0     1     2     3
col_1     4     a     5
col_2     5     8     1

In [34]:
[(lambda x: 2*x)(i) for i in range(5)]

In [5]:
# 常用基本函数
df = pd.read_csv('data/learn_pandas.csv')

In [3]:
df

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
...,...,...,...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [48]:
df.columns

Index(['School', 'Grade', 'Name', 'Gender', 'Height', 'Weight', 'Transfer',
       'Test_Number', 'Test_Date', 'Time_Record'],
      dtype='object')

In [49]:
df = df[df.columns[:7]]

In [59]:
df['School']

0      Shanghai Jiao Tong University
1                  Peking University
2      Shanghai Jiao Tong University
3                   Fudan University
4                   Fudan University
                   ...
195                 Fudan University
196              Tsinghua University
197    Shanghai Jiao Tong University
198    Shanghai Jiao Tong University
199              Tsinghua University
Name: School, Length: 200, dtype: object

In [65]:
df[['School','Grade']]

                            School      Grade
0    Shanghai Jiao Tong University   Freshman
1                Peking University   Freshman
2    Shanghai Jiao Tong University     Senior
3                 Fudan University  Sophomore
4                 Fudan University  Sophomore
..                             ...        ...
195               Fudan University     Junior
196            Tsinghua University     Senior
197  Shanghai Jiao Tong University     Senior
198  Shanghai Jiao Tong University     Senior
199            Tsinghua University  Sophomore

[200 rows x 2 columns]

In [50]:
df

,School,Grade,Name,Gender,Height,Weight,Transfer
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N
...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N

In [66]:
# 汇总函数  前n行，后n行
df.head(3)

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22

In [67]:
df.tail(3)

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   School       200 non-null    object
 1   Grade        200 non-null    object
 2   Name         200 non-null    object
 3   Gender       200 non-null    object
 4   Height       183 non-null    float64
 5   Weight       189 non-null    float64
 6   Transfer     188 non-null    object
 7   Test_Number  200 non-null    int64
 8   Test_Date    200 non-null    object
 9   Time_Record  200 non-null    object
dtypes: float64(2), int64(1), object(7)
memory usage: 15.8+ KB

In [69]:
df.describe()

           Height      Weight  Test_Number
count  183.000000  189.000000   200.000000
mean   163.218033   55.015873     1.645000
std      8.608879   12.824294     0.722207
min    145.400000   34.000000     1.000000
25%    157.150000   46.000000     1.000000
50%    161.900000   51.000000     1.500000
75%    167.500000   65.000000     2.000000
max    193.900000   89.000000     3.000000

In [70]:
# 特征统计
df_demo = df[['Height','Weight']]

In [71]:
df_demo

     Height  Weight
0     158.9    46.0
1     166.5    70.0
2     188.9    89.0
3       NaN    41.0
4     174.0    74.0
..      ...     ...
195   153.9    46.0
196   160.9    50.0
197   153.9    45.0
198   175.3    71.0
199   155.7    51.0

[200 rows x 2 columns]

In [72]:
df_demo.mean()

Height    163.218033
Weight     55.015873
dtype: float64

In [73]:
df_demo.max()

Height    193.9
Weight     89.0
dtype: float64

In [74]:
#  分位数
df_demo.quantile()

Height    161.9
Weight     51.0
Name: 0.5, dtype: float64

In [75]:
df_demo.count() # 非缺失值个数

Height    183
Weight    189
dtype: int64

In [76]:
df_demo.idxmax()  #最大值对应的索引

Height    193
Weight      2
dtype: int64

In [77]:
# axis设置按行或者是按列聚合 默认按列 按行设置为 1
df_demo.mean(axis=1)

0      102.45
1      118.25
2      138.95
3       41.00
4      124.00
        ...
195     99.95
196    105.45
197     99.45
198    123.15
199    103.35
Length: 200, dtype: float64

In [4]:
# 唯一值函数
df['School'].unique()

array(['Shanghai Jiao Tong University', 'Peking University',
       'Fudan University', 'Tsinghua University'], dtype=object)

In [5]:
df['School'].nunique()

4

In [7]:
df['School'].value_counts()

Tsinghua University              69
Shanghai Jiao Tong University    57
Fudan University                 40
Peking University                34
Name: School, dtype: int64

In [14]:
df

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
...,...,...,...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [17]:
def my_mean(x):
     res = x.mean()
     return res
df[['Height']].apply(my_mean)

Height    163.218033
dtype: float64

In [21]:
df['Height']

0      158.9
1      166.5
2      188.9
3        NaN
4      174.0
       ...
195    153.9
196    160.9
197    153.9
198    175.3
199    155.7
Name: Height, Length: 200, dtype: float64